---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.CanRemoveColumn(System.Int32)
source: html/dd8e6a00-0e5a-8b6a-ec9a-62b7db59d87d.htm
---
# Autodesk.Revit.DB.TableSectionData.CanRemoveColumn Method

Verifies that if the column at the given index can be removed.

## Syntax (C#)
```csharp
public bool CanRemoveColumn(
	int nIndex
)
```

## Parameters
- **nIndex** (`System.Int32`) - An integer index.

## Returns
True if the column can be removed, false otherwise.